{
  "recipes": [
    {
      "id": 0,
      "title": "Miso-Butter Roast Chicken With Acorn Squash Panzanella",
      "instructions": "Pat chicken dry with paper towels, season all over with 2 tsp. salt, and tie legs together with kitchen twine. Let sit at room temperature 1 hour.\nMeanwhile, halve squash and scoop out seeds. Run a vegetable peeler along ridges of squash halves to remove skin. Cut each half into ½\"-thick wedges; arrange on a rimmed baking sheet.\nCombine sage, rosemary, and 6 Tbsp. melted butter in a large bowl; pour half of mixture over squash on baking sheet. Sprinkle squash with allspice, red pepper flakes, and ½ tsp. salt and season with black pepper; toss to coat.\nAdd bread, apples, oil, and ¼ tsp. salt to remaining herb butter in bowl; season with black pepper and toss to combine. Set aside.\nPlace onion and vinegar in a small bowl; season with salt and toss to coat. Let sit, tossing occasionally, until ready to serve.\nPlace a rack in middle and lower third of oven; preheat to 425°F. Mix miso and 3 Tbsp. room-temperature butter in a small bowl until smooth. Pat chicken dry with paper towels, then rub or brush all over with miso butter. Place chicken in a large cast-iron skillet and roast on middle rack until an instant-read thermometer inserted into the thickest part of breast registers 155°F, 50–60 minutes. (Temperature will climb to 165°F while chicken rests.) Let chicken rest in skillet at least 5 minutes, then transfer to a plate; reserve skillet.\nMeanwhile, roast squash on lower rack until mostly tender, about 25 minutes. Remove from oven and scatter reserved bread mixture over, spreading into as even a layer as you can manage. Return to oven and roast until bread is golden brown and crisp and apples are tender, about 15 minutes. Remove from oven, drain pickled onions, and toss to combine. Transfer to a serving dish.\nUsing your fingers, mash flour and butter in a small bowl to combine.\nSet reserved skillet with chicken drippings over medium heat. You should have about ¼ cup, but a little over or under is all good. (If you have significantly more, drain off and set excess aside.) Add wine and cook, stirring often and scraping up any browned bits with a wooden spoon, until bits are loosened and wine is reduced by about half (you should be able to smell the wine), about 2 minutes. Add butter mixture; cook, stirring often, until a smooth paste forms, about 2 minutes. Add broth and any reserved drippings and cook, stirring constantly, until combined and thickened, 6–8 minutes. Remove from heat and stir in miso. Taste and season with salt and black pepper.\nServe chicken with gravy and squash panzanella alongside.",
      "image": "miso-butter-roast-chicken-acorn-squash-panzanella",
      "ingredients": "['1 (3½–4-lb.) whole chicken', '2¾ tsp. kosher salt, divided, plus more', '2 small acorn squash (about 3 lb. total)', '2 Tbsp. finely chopped sage', '1 Tbsp. finely chopped rosemary', '6 Tbsp. unsalted butter, melted, plus 3 Tbsp. room temperature', '¼ tsp. ground allspice', 'Pinch of crushed red pepper flakes', 'Freshly ground black pepper', '⅓ loaf good-quality sturdy white bread, torn into 1\" pieces (about 2½ cups)', '2 medium apples (such as Gala or Pink Lady; about 14 oz. total), cored, cut into 1\" pieces', '2 Tbsp. extra-virgin olive oil', '½ small red onion, thinly sliced', '3 Tbsp. apple cider vinegar', '1 Tbsp. white miso', '¼ cup all-purpose flour', '2 Tbsp. unsalted butter, room temperature', '¼ cup dry white wine', '2 cups unsalted chicken broth', '2 tsp. white miso', 'Kosher salt', 'freshly ground pepper']"
    },
    {
      "id": 1,
      "title": "Crispy Salt and Pepper Potatoes",
      "instructions": "Preheat oven to 400°F and line a rimmed baking sheet with parchment. In a large bowl, whisk the egg whites until foamy (there shouldn’t be any liquid whites in the bowl). Add the potatoes and toss until they’re well coated with the egg whites, then transfer to a strainer or colander and let the excess whites drain. Season the potatoes with the salt, pepper, and herbs. Scatter the potatoes on the baking sheet (make sure they’re not touching) and roast until the potatoes are very crispy and tender when poked with a knife, 15 to 20 minutes (depending on the size of the potatoes).\nTransfer to a bowl and serve.",
      "image": "crispy-salt-and-pepper-potatoes-dan-kluger",
      "ingredients": "['2 large egg whites', '1 pound new potatoes (about 1 inch in diameter)', '2 teaspoons kosher salt', '¾ teaspoon finely ground black pepper', '1 teaspoon finely chopped rosemary', '1 teaspoon finely chopped thyme', '1 teaspoon finely chopped parsley']"
    },
    {
      "id": 2,
      "title": "Thanksgiving Mac and Cheese",
      "instructions": "Place a rack in middle of oven; preheat to 400°. Bring evaporated milk and whole milk to a bare simmer in a large saucepan over medium heat. Whisk in garlic powder, onion powder, paprika, pepper, and 1 tsp. salt. Working in batches, whisk in three fourths of the cheddar, then all of the cream cheese.\nMeanwhile, bring a large pot of generously salted water to a boil (it should have a little less salt than seawater). Cook macaroni, stirring occasionally, until very al dente, about 4 minutes. Drain in a colander.\nAdd macaroni to cheese sauce in pan and mix until well coated. Evenly spread out half of macaroni mixture in a 13x9\" baking dish. Sprinkle half of remaining cheddar evenly over. Layer remaining macaroni mixture on top and sprinkle with remaining cheddar. Bake until all of the cheese is melted, about 10 minutes. Let cool slightly before serving.",
      "image": "thanksgiving-mac-and-cheese-erick-williams",
      "ingredients": "['1 cup evaporated milk', '1 cup whole milk', '1 tsp. garlic powder', '1 tsp. onion powder', '1 tsp. smoked paprika', '½ tsp. freshly ground black pepper', '1 tsp. kosher salt, plus more', '2 lb. extra-sharp cheddar, coarsely grated', '4 oz. full-fat cream cheese', '1 lb. elbow macaroni']"
    },
    {
      "id": 3,
      "title": "Italian Sausage and Bread Stuffing",
      "instructions": "Preheat oven to 350°F with rack in middle. Generously butter baking dish.\nPut bread in 2 shallow baking pans and bake, switching position of pans halfway through baking, until just dried out, about 10 minutes.\nHeat 1 tablespoon oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then cook half of sausage, stirring and breaking it into small pieces, until golden brown, about 6 minutes. Transfer with a slotted spoon to a large bowl. Brown remaining sausage in remaining tablespoon oil, transferring to bowl.\nPour off fat from skillet and wipe clean. Heat butter over medium heat until foam subsides, then cook onions, celery, garlic, and ½ teaspoon each of salt and pepper, stirring occasionally, until golden, 12 to 15 minutes. Add vegetables and bread to sausage.\nWhisk together eggs, ½ cup cream, turkey stock, cheese, and parsley, then stir into stuffing and cool completely, about 30 minutes. Reserve 5 cups stuffing to stuff turkey and spoon remainder into baking dish, then drizzle with remaining ¼ cup cream. Cover stuffing and chill.\nAbout 1 hour before stuffed turkey is finished roasting, bring dish of stuffing to room temperature. When turkey is done, increase oven temperature to 425°F and bake stuffing, covered tightly with foil, until hot throughout, about 20 minutes. Remove foil and bake until top is golden and crisp, about 15 minutes more.\nCooks' Note: Bread can be toasted 3 days ahead and kept (once cool) in a sealed bag at room temperature. Stuffing can be prepared (but not baked) 4 hours before roasting turkey. If baking stuffing at the same time as potatoes, put stuffing in upper third of oven and potatoes in bottom third (allow extra time).",
      "image": "italian-sausage-and-bread-stuffing-240559",
      "ingredients": "['1 (¾- to 1-pound) round Italian loaf, cut into 1-inch cubes (8 cups)', '2 tablespoons olive oil, divided', '2 pounds sweet Italian sausage, casings removed, divided', '1 stick unsalted butter, cut into pieces', '3 medium onions, chopped', '4 large celery ribs, chopped', '5 garlic cloves, minced', '4 large eggs, lightly beaten', '¾ cup heavy cream, divided', '½ cup turkey giblet stock or reduced-sodium chicken broth', '1 cup grated Parmigiano-Reggiano (2 ounces)', '½ cup coarsely chopped flat-leaf parsley', '4-qt shallow ceramic or glass baking dish']"
    },
    {
      "id": 4,
      "title": "Instant Pot Lamb Haleem",
      "instructions": "Combine dals, rice, and barley in a medium bowl. Pour in water to cover and swish dals and grains around with your fingers. Drain and repeat process until water runs clear enough to see your hands through. Pour in water to cover and let dals and grains soak at room temperature at least 2 hours, or cover and chill up to 12 hours.\nPlace lamb on a plate, pat dry with paper towels, and season all over with 2 tsp. salt; set aside. Peel ginger by scraping off skin with a spoon. Finely grate half of ginger; set aside. Thinly slice remaining ginger. Stack slices and cut crosswise into matchsticks; set aside.\nIf using an electric pressure cooker, combine shallots and ghee in pot and set to sauté function or high. Cook, stirring often and adjusting heat as needed if your cooker has that option, until shallots are just beginning to brown, about 8 minutes (or about 6 minutes if cooking in oil). Reduce to normal function or medium if possible, or, if your cooker doesn’t have a lower setting, turn off for a minute if mixture is getting too hot. Add reserved ginger matchsticks and cook, stirring often, until shallots are brown and crisp and ginger is frizzled, 4–10 minutes, depending on your cooker. Using a slotted spoon, transfer shallots and ginger to a plate, spreading out into a single layer. Season lightly with salt; let cool.\nAdd garlic, garam masala, cayenne, turmeric, and reserved grated ginger, and cook, stirring constantly, until fragrant, about 30 seconds. Add lamb and stir to coat in spices. Cook, stirring often with a wooden spoon and repeatedly adding splashes of water as spices begin to stick to bottom of pot and scraping up browned bits, until flavors come together, about 15 minutes.(Bhuna, the process of repeated sticking and scraping, is a Southeast Asian cooking technique that brings out the flavor of the spices and ensures they don’t taste raw and grainy.)\nDrain dal mixture and add to pot along with 1 tsp. salt and 5 cups water. Secure lid and bring to full pressure according to manufacturer’s directions. Cook 1½ hours. Let sit 20 minutes, then manually release pressure and open up.\nTaste haleem and add more salt and cayenne if needed. Add chiles if using. (These are for flavor, not heat; feel free to leave them out.) Simmer on normal function or medium, stirring often, 5 minutes. Stir in ½ cup cilantro.\nServe haleem with white onion, lime wedges, reserved crispy shallots and ginger, and more chopped cilantro.\nIf using a medium Dutch oven or stovetop pressure cooker, cook shallots and ghee over high heat, stirring often, until shallots are just beginning to brown, about 8 minutes (or about 6 minutes if cooking in oil). Add reserved ginger matchsticks and cook, stirring often, until shallots are brown and crisp and ginger is frizzled, 5–8 minutes. Using a slotted spoon, transfer shallots and ginger to a plate, spreading out in a single layer. Season lightly with salt; let cool.\nReduce heat to medium, add garlic, garam masala, cayenne, turmeric, and reserved grated ginger, and cook, stirring constantly, until fragrant, about 30 seconds. Add lamb and stir to coat in spices. Cook, stirring often with a wooden spoon and repeatedly adding splashes of water as spices begin to stick to bottom of pot and scraping up browned bits, until flavors come together, about 15 minutes. (Bhuna, the process of repeated sticking and scraping, is a Southeast Asian cooking technique that brings out the flavor of the spices and ensures they don’t taste raw and grainy.)\nDrain dal mixture and add to pot along with 1 tsp. salt and 6½ cups water (if using a Dutch oven) or 5 cups water (for pressure cooker). Increase heat to high and bring to a boil, then reduce heat to the low, cover pot, and cook, stirring and scraping bottom of pot every 15–20 minutes, until meat is falling off the bone and dals and grains have nearly melted into the stew, 4½–5 hours. (If using a stovetop cooker, increase heat to high and bring to a boil. Secure lid and bring to full pressure according to manufacturer’s directions. Cook 1½ hours. Let sit 20 minutes, then manually release pressure and open up.)\nTaste haleem and add more salt and cayenne if needed. Add chiles if using. (These are for flavor, not heat; feel free to leave them out.) Simmer over medium heat, stirring often, 5 minutes. Stir in ½ cup cilantro.\nServe haleem with white onion, lime wedges, reserved crispy shallots and ginger, and more chopped cilantro.\nDo ahead: Haleem can be made 1 day ahead. Let cool; cover and chill. Reheat over medium until warmed through.",
      "image": "instant-pot-lamb-haleem",
      "ingredients": "['¾ cup assorted dals (such as chana dal, moong dal, masoor dal, and/or urad dal)', '¼ cup white jasmine rice or other long-grain rice', '¼ cup pearl barley', '1½ lb. bone-in lamb stew meat', '3 tsp. kosher salt, divided, plus more', '1 6\" piece fresh ginger', '3 medium shallots, thinly sliced', '⅓ cup ghee or vegetable oil', '4 garlic cloves, finely grated', '2 Tbsp. plus 1½ tsp. garam masala', '1 tsp. (or more) cayenne pepper', '1 tsp. ground turmeric', '3 green Thai chiles, stems removed (optional)', '½ cup (lightly packed) chopped cilantro, plus more for serving', '½ white onion, finely chopped', '2 limes', 'cut into wedges']"
    },
    {
      "id": 5,
      "title": "Spiced Lentil and Caramelized Onion Baked Eggs",
      "instructions": "Place an oven rack in the center of the oven, then preheat to 350°F.\nIn a medium, oven-safe pan, heat 1 Tbsp. olive oil over medium heat. Add 1 large, thinly sliced onion and ½ tsp. Kosher salt. Cook, stirring often, until golden brown, about 25 minutes.\nAdd ½ tsp. turmeric, 1 tsp. cumin, ¼ tsp. Aleppo pepper (or ⅛ tsp. crushed red pepper flakes), and 2 Tbsp. tomato paste. Cook and stir constantly until the onions are coated and the tomato paste has darkened slightly, about 2 minutes. Add ⅓ cup water; stir and scrape up all the browned bits on the bottom of the pan for 1 to 2 minutes, or until the liquid looks thickened and saucy. Add one 14-oz. can of lentil soup; cook, stirring to combine, 1 to 2 minutes. Turn off the heat and season with salt, pepper, and more Aleppo pepper or red pepper flakes to taste.\nUsing a spoon, create 3 wells in the lentil mixture. Carefully crack 1 egg into each well. Transfer the pan to the oven and bake until the whites of the eggs are just set, 11 to 13 minutes.\nWhile the eggs bake, in a small pot or butter warmer, heat 2 Tbsp. unsalted butter, ghee, or olive oil over medium heat. Add ½ tsp. cumin seeds; swirl the pan until the seeds start to sizzle and brown, 30 seconds to 1 minute. Remove from the heat.\nDrizzle the finished eggs with the butter mixture, season with salt and pepper, and garnish with parsley before serving.",
      "image": "spiced-lentil-and-caramelized-onion-baked-eggs",
      "ingredients": "['1 (14.5-ounce) can basic lentil soup, like Amy’s', '1 large onion, thinly sliced', '½ tsp. turmeric', '1 tsp. cumin', '¼ tsp. Aleppo pepper or ⅛ tsp. crushed red pepper flakes', '2 Tbsp. tomato paste', '3 large eggs', '2 Tbsp. ghee, unsalted butter, or olive oil', '½ tsp. whole cumin seeds', 'Olive oil', 'Kosher salt and freshly ground black pepper', 'Parsley', 'for finishing']"
    },
    {
      "id": 6,
      "title": "Hot Pimento Cheese Dip",
      "instructions": "Put the chipotle peppers and adobo sauce in a small food processor or blender and blend until the mixture turns into a smooth purée. Set aside. The chipotle purée can be made in advance, stored in an airtight container, and refrigerated for up to 2 months.\nOn a cutting board, sprinkle the garlic with a large pinch of salt and gather it into a small mound. Holding the blunt side of the knife with both hands, press and scrape the knife’s sharp end, holding it at a slight angle, across the garlic mound to flatten it. Repeat, dragging it across the garlic, until you have a smooth paste. Set aside.\nIn a small bowl, mix the cornstarch and 1½ tsp. of the evaporated milk into a slurry. Pour the rest of the evaporated milk into a medium saucepan and stir in the slurry. Bring to a boil over medium-high heat, whisking constantly. Turn the heat to low and add the Cheddar gradually by the handful, stirring until the Cheddar is melted and the mixture is smooth. Add the cream cheese and whisk until it melts. Stir in the mayonnaise, pimento peppers, 1½ tsp. of the chipotle purée, and the garlic paste. Season with salt. Transfer to a serving bowl or keep it warm in a slow cooker and serve immediately.\nTo reheat the sauce, microwave it, stirring every 30 seconds, until fully melted.",
      "image": "hot-pimento-cheese-dip-polina-chesnakova",
      "ingredients": "['1 (7 oz./200 g) can chipotle in adobo sauce', '½ garlic clove, minced', 'Kosher salt', '1½ tsp. cornstarch', '1 (5 fl oz./150 ml) can evaporated milk (about ½ cup plus 2 Tbsp)', '8 oz. (230 g) sharp or extra-sharp Cheddar cheese, coarsely grated (about 2 cups)', '2 oz. (55 g) cream cheese, roughly diced, at room temperature', '¼ cup (60 g) mayonnaise', '1 (4 oz./115 g) jar diced pimento peppers, drained', '1½ tsp. Chipotle Pepper Purée']"
    },
    {
      "id": 7,
      "title": "Spiral Ham in the Slow Cooker",
      "instructions": "Pour 3 cups of water into a 7-quart slow cooker. Add the ham, cut-side up, as well as the parsnips and carrots. Pour the maple syrup and apple juice over the ham, and sprinkle the brown sugar over the top. Cook on high, uncovered, for 30 to 45 minutes, then cover the slow cooker and cook on low until the ham is tender, 3 to 4 hours. Hams vary in size and tenderness, so be patient. When it’s tender, the meat should come off the bone with very little resistance. Taste a small piece for tenderness.\nTransfer the ham and vegetables to a deep serving platter (reserve the liquid in the pot). Use a pair of kitchen shears or scissors to cut the slices of ham off the bone and let them fall onto the platter. Stir both kinds of mustard and the vinegar into the cooking liquid left in the slow cooker and taste for seasoning—the sauce may or may not need salt. Pour the liquid over the ham and vegetables, and serve.",
      "image": "spiral-ham-in-the-slow-cooker-guarnaschelli",
      "ingredients": "['1 (6- to 7-pound) bone-in, hickory-smoked, uncured fully cooked ham', '5 medium parsnips, peeled and halved lengthwise', '5 medium carrots, peeled and halved lengthwise', '1 cup maple syrup', '2 cups unsweetened apple juice', '½ cup packed dark brown sugar', '½ cup smooth Dijon mustard', '½ cup grainy Dijon mustard', '2 tablespoons apple cider vinegar', 'Kosher salt (if needed)']"
    },
    {
      "id": 8,
      "title": "Butternut Squash and Apple Soup",
      "instructions": "Cook bacon in a 6-quart heavy pot over medium heat, stirring occasionally, until crisp, then transfer with a slotted spoon to paper towels to drain, reserving 2 tablespoons fat in pot. (Add vegetable oil if your bacon is very lean and doesn't yield enough fat.)\nCook celery, carrot, and onion in fat in pot over low heat, covered, stirring occasionally, until softened but not browned, 10 to 12 minutes. Add cinnamon and cook, uncovered, stirring, 1 minute.\nWhile vegetables are cooking, peel potatoes and coarsely chop. Peel and core 1 apple and coarsely chop.\nStir squash, potato, chopped apple, stock, 2 cups water, 1 teaspoon salt and 1/2 teaspoon pepper into onion mixture, then simmer, uncovered, stirring occasionally, until vegetables are very tender, 15 to 20 minutes.\nPuree soup in 4 batches in a blender (use caution when blending hot liquids), then heat in cleaned pot over medium low heat, stirring occasionally. (Add additional 1/2 cup water to thin, if necessary.)\nWhile soup is heating, cut enough of remaining apple into thin matchsticks (about 1 1/2-inches long) to measure about 1/2 cup.\nServe soup topped with sour cream, bacon, and apple matchsticks.\nCooks' Notes: Soup can be made 2 days ahead and chilled, covered once cooled. Cooked bacon can be kept refrigerated in an airtight container—reheat in a 375°F oven in a small baking pan.",
      "image": "butternut-squash-apple-soup-365210",
      "ingredients": "['6 slices bacon, cut crosswise into ½-inch pieces', '2 celery ribs, chopped', '1 carrot, chopped', '1 medium onion, chopped', '¼ teaspoon cinnamon', '¾ pound boiling potatoes', '2 medium Granny Smith apples (about ¾ pound total)', '1 ½ pounds butternut squash, peeled, seeded, and cut into ½-inch pieces (3½ to 4 cups)', '2 cups reduced-sodium chicken stock or broth', '2 to 2½ cups water', 'Sour cream']"
    },
    {
      "id": 9,
      "title": "Caesar Salad Roast Chicken",
      "instructions": "Place a rack in lower third of oven; preheat to 450°F. Whisk anchovies, garlic, 3 Tbsp. mayonnaise, 1 Tbsp. mustard, 1 Tbsp. oil, and 1½ tsp. pepper in a small bowl. Set aside 1 Tbsp. anchovy mayo in another small bowl.\nPat chicken dry; season outside and inside all over with salt. Arrange breast side up in a cast-iron skillet and tuck wings underneath. Arrange shallots around (if using legs, nestle under and around); season with salt and pepper. Brush remaining anchovy mayo all over chicken, making sure to get it into the nooks and crannies, then brush shallots with any leftover anchovy mayo.\nPlace chicken in oven so legs are facing toward the back (this is the hottest part of the oven and will help the legs cook before the breast dries out) and roast until some anchovy mayo and fat begin to drip onto shallots, about 15 minutes. Remove from oven and, using tongs, turn shallots to coat in drippings. Return skillet to oven and continue to roast chicken, stirring shallots once or twice, until golden brown and an instant-read thermometer inserted into the thickest part of breast registers 155°F, 45–55 minutes. If skin starts to get too dark on the top before chicken is done, tent area with foil, leaving the rest of the bird exposed. If using chicken legs, start checking at 40 minutes (a thermometer inserted right at the joint should register 160°F). Transfer chicken and shallots to a cutting board, leaving behind any juices and fat in skillet. If shallots need more time to soften and darken, roast a bit longer without chicken before proceeding. Reserve skillet.\nReduce oven temperature to 400°F. Finely grate half of zest of 1 lemon into a large bowl; cut lemon in half and squeeze in juice. Add reserved 1 Tbsp. anchovy mayo, remaining 3 Tbsp. mayo, and remaining 1 Tbsp. oil and whisk to combine, then stir in Parmesan. Season with salt and pepper. Set dressing aside.\nAdd bread to reserved skillet with fat and turn to coat. Return skillet to oven and toast bread, tossing halfway through, until golden brown and crisp, 12–15 minutes. Transfer croutons to bowl with reserved dressing. Add romaine and gently toss until lettuce is well coated. Season salad with salt and pepper.\nSlice remaining lemon into wedges. Carve chicken and nestle back into skillet or transfer to a platter; arrange shallots and lemon wedges around. Serve with salad and more mustard alongside.",
      "image": "caesar-salad-roast-chicken",
      "ingredients": "['8 anchovies, mashed to a paste', '8 garlic cloves, finely grated', '6 Tbsp. mayonnaise, divided', '1 Tbsp. Dijon mustard, plus more for serving', '2 Tbsp. extra-virgin olive oil, divided', '1½ tsp. freshly ground black pepper, plus more', '1 (3½–4-lb.) whole chicken or 4 chicken legs (thigh and drumstick; about 3 lb.)', 'Kosher salt', '8 medium shallots, unpeeled, halved lengthwise', '2 lemons, divided', '1 oz. Parmesan, finely grated', '4 oz. country-style bread, torn into (1½\") pieces', '2 romaine hearts', 'leaves separated', 'torn']"
    },
    {
      "id": 10,
      "title": "Chicken and Rice With Leeks and Salsa Verde",
      "instructions": "Season chicken with salt and pepper. Melt 2 Tbsp. butter in a large high-sided skillet over medium-high heat. Add leeks and half of lemon zest, season with salt and pepper, and mix to coat leeks in butter. Reduce heat to medium-low, cover, and cook, stirring occasionally, until leeks are somewhat tender, about 5 minutes. Remove lid, increase heat to medium-high, and cook, stirring occasionally, until tender and just starting to take on color, about 3 minutes. Add rice and cook, stirring often, 3 minutes, then add broth, scraping up any browned bits. Tuck short sides of each chicken thigh underneath so they are touching and nestle seam side down into rice mixture. Bring to a simmer. Cover, reduce heat to medium-low, and cook until rice is tender and chicken is cooked through, about 20 minutes. Remove from heat. Cut remaining 1 Tbsp. butter into small pieces and scatter over mixture. Re-cover and let sit 10 minutes.\nMeanwhile, pulse anchovy, garlic, capers, a few pinches of red pepper flakes, and remaining lemon zest in a food processor until finely chopped. Add herbs; process until a paste forms. With motor running, gradually stream in oil until loosened to a thick sauce. Add half of lemon juice; season salsa verde with salt.\nDrizzle remaining lemon juice over chicken and rice. Serve with salsa verde.",
      "image": "chicken-and-rice-with-leeks-and-salsa-verde",
      "ingredients": "['1½ lb. skinless, boneless chicken thighs (4–8 depending on size)', 'Kosher salt, freshly ground pepper', '3 Tbsp. unsalted butter, divided', '2 large or 3 medium leeks, white and pale green parts only, halved lengthwise, thinly sliced', 'Zest and juice of 1 lemon, divided', '1½ cups long-grain white rice, rinsed until water runs clear', '2¾ cups low-sodium chicken broth', '1 oil-packed anchovy fillet', '2 garlic cloves', '1 Tbsp. drained capers', 'Crushed red pepper flakes', '1 cup tender herb leaves (such as parsley, cilantro, and/or mint)', '4–5 Tbsp. extra-virgin olive oil']"
    },
    {
      "id": 11,
      "title": "Gorditas con Camarones",
      "instructions": "Stir masa, 1 Tbsp. lard, 1 tsp. Diamond Crystal or ½ tsp. Morton salt, and 1 cup water in a medium bowl until a soft and slightly sticky dough forms. If dry, mix in another 1 Tbsp. water. Cover and let sit at least 30 minutes and up to 3 hours.\nMeanwhile, bring guajillo chiles, morita chiles, coriander, and 1½ cups water to a boil in a small saucepan. Cover, remove from heat, and let sit, stirring occasionally, 30 minutes to allow chiles to soften. Transfer to a blender and purée until smooth; set aside.\nPlace rack in lowest position in oven; preheat to 500°F. Brush a rimmed baking sheet with 2 Tbsp. lard. Divide dough into 4 pieces and form into balls. Set on work surface and cover with a damp kitchen towel. Place 1 ball between 2 sheets of parchment or wax paper. Using a small skillet or saucepan, gently press ball into a 5\"-diameter disk. Carefully peel away parchment; place on prepared baking sheet. Repeat with remaining balls.\nBake gorditas until outer edges are lightly golden, 10–12 minutes. Turn over and bake until golden brown and crisp, 10–12 minutes. Transfer to plates and let cool 10 minutes. Insert a paring knife into side of gordita and, using a slow sawing motion, cut open along one side (keep other side intact).\nHeat remaining 2 Tbsp. lard in a large skillet over high. Cook shrimp until lightly browned and just cooked through, about 1 minute per side. Transfer to a medium bowl. Reduce heat to medium and cook garlic in same skillet, tossing often, until beginning to brown, about 1 minute. Add thyme sprigs, vinegar, agave, 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt, and reserved chile purée. Cook, stirring occasionally, until brick red and the consistency of a thick sauce, 6–8 minutes. Add shrimp and any juices and cook 1 minute. Remove from heat; add butter and stir constantly until melted and sauce is glossy. Season with more salt if needed. Remove and discard thyme.\nFill gorditas with shrimp mixture, onion, avocado, and cilantro. Serve with lime wedges for squeezing over.",
      "image": "gorditas-con-camarones",
      "ingredients": "['1⅓ cups instant corn masa flour (such as Maseca)', '5 Tbsp. lard, melted, or vegetable oil, divided', '2½ tsp. Diamond Crystal or 1½ tsp. Morton kosher salt, divided, plus more', '4 guajillo or dried New Mexico chiles, stems and seeds removed', '2 morita chiles, stems removed, or 2 canned chipotle chiles in adobo', '1 tsp. ground coriander or cumin', '1½ lb. medium shrimp, peeled, deveined', '4 garlic cloves, thinly sliced', '2 sprigs thyme', '1 Tbsp. apple cider vinegar', '1 tsp. agave syrup or honey', '3 Tbsp. unsalted butter, cut into pieces', 'Sliced onion', 'sliced avocado', 'cilantro leaves with tender stems', 'and lime wedges (for serving)']"
    },
    {
      "id": 12,
      "title": "Enfrijoladas",
      "instructions": "Using 2 Tbsp. oil, brush both sides of each tortilla. Heat a large skillet over medium-high. Working in batches, cook until lightly browned and starting to crisp, about 1 minute per side. Set aside.\nHeat remaining 3 Tbsp. oil in same skillet over medium-high. Cook chorizo, breaking up with a wooden spoon, until browned and cooked through, 7–9 minutes. Using a slotted spoon, transfer to a medium bowl; set aside.\nAdd garlic and ½ onion to same skillet, season with salt, and cook, tossing occasionally, until tender and beginning to brown, 6–8 minutes. Using slotted spoon, transfer garlic mixture to a blender; reserve pan with oil. Add beans and broth to blender and purée until smooth (it should be the consistency of yogurt); season with salt.\nSet reserved pan over medium-high and heat oil. Transfer bean purée to skillet and bring to a boil. Reduce heat to low. Working one at a time and using tongs, dip tortillas in bean purée, turning to coat and leaving until softened, about 3 seconds per side (they will soften more as they sit). Transfer to a baking sheet as you go. Spoon 1 Tbsp. chorizo and 1 Tbsp. queso fresco across the center of each tortilla; fold over like a taco.\nDivide among plates and spoon remaining bean purée over. Top with cilantro, avocado, more onion, remaining chorizo, and remaining queso.",
      "image": "enfrijoladas",
      "ingredients": "['5 Tbsp. vegetable oil, divided', '8 corn tortillas', '12 oz. fresh chorizo', '3 garlic cloves, crushed', '½ medium white onion, thinly sliced, plus more for serving', 'Kosher salt', '2 (15-oz.) cans black beans, rinsed, or 3 cups Frijoles de la Olla, drained', '1½ cups low-sodium chicken broth', '6 oz. queso fresco or Cotija cheese, crumbled', 'Cilantro leaves with tender stems and sliced avocado (for serving)']"
    },
    {
      "id": 13,
      "title": "Caramelized Plantain Parfait",
      "instructions": "Heat oil in a large nonstick skillet over medium-high. Cook plantains, turning once, until deep golden brown, about 3 minutes per side. Transfer to paper towels to drain; season with salt.\nDivide yogurt among bowls; top with plantains and mangoes, then nuts, seeds, and/or coconut as desired.",
      "image": "caramelized-plantain-parfait",
      "ingredients": "['6 Tbsp. virgin coconut oil', '4 ripe (spotted) plátanos manzanos or 2 large ripe (black) plantains, peeled, sliced in half lengthwise', 'Kosher salt', '3 cups plain unsweetened coconut milk yogurt or Greek yogurt', '2 ripe mangoes, thinly sliced', 'Toasted nuts', 'seeds', 'and/or unsweetened shredded coconut (for serving)']"
    },
    {
      "id": 14,
      "title": "Chicken and Potato Gratin With Brown Butter Cream",
      "instructions": "Season chicken all over with 4 tsp. salt. Place in an airtight container and cover. Chill at least 1 hour and up to 1 day.\nPlace a rack in middle of oven; preheat to 425°F. Toss potatoes, shallots, and 2 tsp. salt in a large bowl.\nMelt 4 Tbsp. butter in a small saucepan over medium heat and cook, stirring often, until butter foams, then browns, 5–8 minutes. Immediately remove from heat (it will continue to darken) and stir in cream, garlic, pepper, nutmeg, and remaining 1½ tsp. salt. Set saucepan over medium-low heat and cook, stirring, until salt is dissolved and mixture is warm to the touch. Stir in thyme and sage; remove from heat.\nHeat remaining 1 Tbsp. butter in a large stainless-steel skillet over medium-high until melted and bubbling. Working in 2 batches, cook chicken, skin side down, until golden underneath, about 5 minutes. Transfer chicken to a 13x9\" or 3-qt. baking dish and arrange skin side up. Set skillet with pan drippings aside. Nestle potatoes and shallots around chicken (don’t place on top). Pour brown butter cream over chicken and vegetables, making sure herbs and spices are evenly dispersed and tucking herbs into vegetables so they don’t get too crispy when they bake.\nBake gratin until cream is mostly reduced and chicken and vegetables are dark golden brown, about 40 minutes. Let gratin cool 5–10 minutes.\nMeanwhile, pulse bread in a food processor until pieces are about oat-size (you should have about 1¼ cups). Toss breadcrumbs in pan drippings in reserved skillet to coat. Cook over medium heat, scraping up browned bits with a spatula, until deep golden brown, 5–7 minutes. Let cool.\nTo serve, top gratin with breadcrumbs. Serve lemon wedges alongside for squeezing over if desired.",
      "image": "chicken-and-potato-gratin-brown-butter-cream",
      "ingredients": "['3 lb. skin-on, bone-in chicken thighs and drumsticks', '7½ tsp. kosher salt, divided', '1 lb. small potatoes (such as fingerling or baby Yukon Gold), halved lengthwise', '8 oz. small or medium shallots, halved through root ends', '5 Tbsp. unsalted butter, divided', '¾ cup heavy cream', '2 garlic cloves, finely grated', '½ tsp. freshly ground black pepper', '¼ tsp. freshly grated or ground nutmeg', '8 sprigs thyme', '8 sage leaves', '3½ oz. country-style bread, preferably day-old, torn into large pieces', '1 lemon', 'cut into wedges (optional)']"
    },
    {
      "id": 15,
      "title": "Roasted Beets With Crispy Sunchokes and Pickled Orange-Ginger Purée",
      "instructions": "Place the zest strips in a small saucepan and cover with water. Bring the water to a boil, then drain. Repeat this process two more times (blanching the orange zest removes any bitter flavors). Place the ginger and orange zest in a jar or heatproof container. In a saucepan, bring the lime juice, vinegar, sugar, and ¾ teaspoon salt to a boil. Pour over the ginger and orange. Let cool to room temperature, then cover and refrigerate overnight. The pickled ginger can be refrigerated for a couple of months.\nDrain the pickled ginger and orange and save 3 tablespoons of the pickling liquid. Add both to a blender or mini food processor, along with the olive oil, chile, and remaining 2 tablespoons salt. Blend until very smooth, scraping down the side of the blender as needed. Transfer to a container and refrigerate until ready to use. The puree can be made a couple of days ahead. (Makes about 1 cup.)\nPreheat the oven to 375°F. Place the beets in a baking dish (if using a mix of red and golden beets, separate them into two smaller dishes and divide the oil, vinegar, and water between the two dishes). Drizzle with the oil and add the water and vinegar. Season with salt and pepper. Cover the pan with foil and roast until the beets are tender when pierced with a knife; this can take anywhere from 30 minutes to an hour, depending on the thickness of the beets. Let the beets cool, then peel and cut into 1-inch wedges. Place each color of beet, along with any accumulated juices, into a small mixing bowl.\nIn a skillet, heat the oil over medium-low heat. Add the cashews and cook, stirring constantly, until golden brown. Transfer to a heat-proof bowl.\nPour 1 inch of oil into a small saucepan and add the sunchokes (there should be just enough oil to cover the sunchokes; add more oil if needed). Turn the heat to medium and stir occasionally; when the sunchokes begin to sizzle and foam, increase the temperature to high and continue frying, stirring constantly, until the sunchokes are light golden brown. At this point the sunchokes will rapidly go from golden brown to burnt, so quickly transfer the chips to paper towels to drain. Lightly season with salt. The sunchoke chips can be stored in an airtight container at room temperature for a day or two, or until they start to soften. (Makes about ½ cup.)\nUsing a sharp knife, cut the peel and pith off the orange. Working over a bowl, cut the orange between the membranes to release the segments. Dice the segments, then return them to the bowl.\nDrizzle the beet wedges with a little bit of olive oil, season with salt, and toss.\nSpread the ginger puree on the bottom of a shallow serving bowl or plate. Arrange the beets over the puree. Sprinkle the chopped orange segments over the beets and grind some pepper over the dish. Top with the cashews, herbs, and sunchoke chips. Serve.",
      "image": "roasted-beets-with-crispy-sunchokes-and-pickled-orange-ginger-puree",
      "ingredients": "['Strips of zest (no pith) from 1 medium orange', '2½ ounces fresh ginger (about one 5-inch piece), peeled and thinly shaved (use a mandoline if you have one)', '¼ cup fresh lime juice', '¼ cup champagne vinegar', '¼ cup sugar', '2 tablespoons plus ¾ teaspoon kosher salt', '2 tablespoons extra-virgin olive oil', '½ Thai chile, with seeds', '1½ pounds beets (use a mix of colors if possible), about 5 medium', '¼ cup extra-virgin olive oil', '¼ cup white wine vinegar', '¼ cup water', 'Kosher salt and freshly ground black pepper', '1 tablespoon extra-virgin olive oil', '½ cup roughly chopped cashews', '4 large sunchokes, thinly shaved (use a mandoline if you have one)', 'Vegetable oil', 'Kosher salt', '1 medium orange', 'Roasted Beets', 'Extra-virgin olive oil', 'Kosher salt', '¼ cup Pickled Orange-Ginger Puree', 'Toasted Cashews', '1 tablespoon roughly chopped tarragon', '1 tablespoon roughly chopped dill fronds', 'Sunchoke Chips']"
    },
    {
      "id": 16,
      "title": "Kale and Pumpkin Falafels With Pickled Carrot Slaw",
      "instructions": "Preheat oven to 220°C (425°F).\nPlace the pepitas into the bowl of a food processor and process until finely chopped. Add the kale, garlic, chickpeas, turmeric, coriander, salt and pepper and process until well combined. Add the pumpkin and stir through to combine. Shape large tablespoonfuls of pumpkin mixture into balls. Place on a baking tray lined with non-stick baking paper and flatten slightly. Brush well with oil, then bake for 25 minutes or until golden and crisp.\nTo make the pickled carrot slaw, place the carrots, vinegar, honey, chile and coriander in a bowl and toss to combine. Set aside for 5 minutes to pickle.\nTo serve, divide the pickled carrot slaw between bowls and top with pumpkin falafels and serve with yoghurt and tahini.",
      "image": "kale-and-pumpkin-falafels-with-pickled-carrot-slaw",
      "ingredients": "['¾ cup (120g or 4½ oz) toasted pepitas (pumpkin seeds)', '3 cups (90g or 3 oz) shredded kale, stems removed (about 3 large leaves)', '1 clove garlic, crushed', '1 (16 oz or 400g ) can chickpeas (garbanzo beans), rinsed, drained', '1½ teaspoons ground turmeric', '½ cup (6g or ¼ oz) coriander (cilantro) leaves', 'Sea salt and cracked black pepper', '3 cups (450g or 1 lb) firmly packed grated pumpkin', 'Extra virgin olive oil, for brushing', 'Plain Greek-style yogurt and hulled tahini, to serve', '6 carrots, shredded using a julienne peeler', '2 tablespoons apple cider vinegar', '2 tablespoons honey', '2 large red chiles, sliced', '½ cup (6g or ¼ oz) coriander (cilantro) leaves']"
    },
    {
      "id": 17,
      "title": "Maple and Chile Roasted Squash With Quinoa Tabouli",
      "instructions": "Preheat oven to 220°C (425°F).\nScoop the seeds from the squash and discard. Place squash, cut side up, onto a baking tray. Using the tip of a sharp knife, make some shallow slashes into the squash flesh. Combine the oil, maple, chile, salt and pepper and brush over the squash. Cover with aluminium foil and roast for 20 minutes. Remove the foil and roast for a further 40 minutes or until the squash is golden and soft.\nTo make the quinoa tabouli, in a large bowl combine the quinoa, mint, and arugula.\nTo make the lemon tahini dressing, in a small bowl, place the tahini, lemon juice, water, garlic and salt. Mix to combine.\nTo serve, place the squash onto a serving platter and top with the tabouli. Drizzle with the lemon tahini dressing and sprinkle over almonds.",
      "image": "maple-chile-roasted-pumpkin-with-quinoa-tabouli",
      "ingredients": "['1 (2kg or 4 lb or 4 oz) butternut squash or 2 (1kg or 2 lb or 3 oz) butternut squash, halved', '2 tablespoons extra virgin olive oil', '1 tablespoon pure maple syrup', '1 teaspoon chile flakes', 'Sea salt and cracked black pepper', '1/4 cup (40g or 1 ½ oz) roasted almonds, chopped', '2 cups (320g or 11 ¼ oz) cooked quinoa', '½ cup (8g or ¼ oz) torn mint leaves', '60g (2 oz) wild rocket (arugula) leaves', '½ cup (140g or 5 oz) hulled tahini', '⅔ cup (160ml or 5 ½ fl oz) lemon juice', '1 cup (250ml or 8 ½ fl oz) water', '1 clove garlic, crushed', 'Sea salt flakes']"
    },
    {
      "id": 18,
      "title": "Chhena Poda (Spiced Cheesecake)",
      "instructions": "Preheat the oven to 350°F. Butter a 9-inch nonstick metal cake pan with some ghee.\nIn a large bowl, stir together the paneer, confectioners’ sugar, and cardamom until incorporated but still slightly chunky. Add the semolina, ghee, and milk and whisk until smooth. Stir in the cashews and raisins and set aside.\nSprinkle the granulated sugar over the bottom of the prepared cake pan. Set the pan on the stove over medium heat and once the sugar just begins to bubble and turn pale golden brown (the sugar will continue to caramelize in the oven, so don’t let it get any darker right now), after 8 to 10 minutes, remove the pan from the heat using tongs. (This step is a bit tricky and you might be tempted to move the sugar around with a spoon while it is bubbling, but don’t touch it—just let it caramelize on its own.) You will know it’s ready for the cake batter when it’s bubbling but is still slightly grainy and just turning a pale golden color. Pour the batter into the pan, using a rubber spatula to scrape the bowl clean. It should settle into an even layer on its own, but if it doesn’t, use the spatula to create a smooth surface.\nWearing oven mitts, carefully transfer the pan to the oven and bake until a toothpick inserted into the center of the cake comes out clean, 40 to 45 minutes. Transfer to a wire rack and cool in the pan to room temperature. Run a paring knife around the cake’s edges and then place a serving platter larger than the diameter of the cake over the cake and gently flip the cake over—it should slide out, with caramel coming out with it like you would see in a flan (though some caramel will be left in the pan—this is fine).\nSlice and serve with freshly whipped cream or sliced almonds, if desired. The cake will keep in a covered container in the refrigerator for up to 3 days.\nNote: To clean the pan, add some boiling water to the pan and let it sit for at least 30 minutes to loosen up the browned sugar sticking to the surface of the pan before cleaning it.",
      "image": "chhena-poda-paneer-cheesecake",
      "ingredients": "['Ghee, for the cake pan', '8 ounces paneer, preferably homemade', '¼ cup confectioners’ sugar', '½ teaspoon ground cardamom', '2 tablespoons semolina', '1½ tablespoons ghee, store-bought or homemade', '¼ cup whole milk', '2 tablespoons roasted cashews', '2 tablespoons golden raisins', '3 tablespoons granulated sugar', 'Freshly whipped cream or sliced almonds (optional)', 'for serving']"
    },
    {
      "id": 19,
      "title": "Paneer",
      "instructions": "In a medium saucepan, heat the milk to 195°F over medium heat. Using a wooden spoon, stir frequently during the heating process to prevent the milk from scalding. Be sure to scrape the bottom of the pan when you stir because this is where the milk is most prone to sticking. The milk will become foamy and bubbles will form on its surface once it reaches the desired temperature.\nRemove from the heat and stir in the lemon juice until evenly distributed, which will cause the separation of curds from the whey. The process should begin right away, but don’t fret if it takes a minute or two. Cover the pan and set aside at room temperature for 10 minutes to let the acid work its magic. Check the mixture at this point: It should be slightly yellow and the curds should have completely separated from the whey. Don’t panic if this hasn’t happened completely yet. Simply add another teaspoon of acid and set aside for a few minutes more. This should do the trick.\nLine a fine-mesh sieve with cheesecloth and set the sieve over a bowl. Ladle the curds and whey into the sieve. Reserve the whey for another use. Season the curds (still in the sieve) with salt, stirring it in using a wooden spoon, then gather up the edges of the cheesecloth into a tight bundle and squeeze the excess whey from the curds. Place the cheesecloth and curds on a large plate and shape them into a square. Wrap the cheesecloth edges around the paneer and place a second plate on top of it to compress it. Set aside at room temperature for 30 minutes. At this point the paneer is ready to use or it can be refrigerated in a covered container for up to 3 days.",
      "image": "homemade-paneer-recipe",
      "ingredients": "['2 quarts whole milk', 'Juice of 2 lemons', '½ teaspoon kosher salt']"
    },
    {
      "id": 20,
      "title": "Sloppy Joe Shirred Eggs With Spinach",
      "instructions": "Preheat your oven to 400°F. Combine the carrot, tomatoes plus their juice, and 1 cup water in a blender. Blitz till it’s as smooth as your blender allows.\nIn an ovenproof 12-inch sauté pan or skillet set over medium heat, cook 1 tablespoon of the olive oil and the minced garlic. Watch for the garlic to start sizzling, then stir in the spinach and ½ teaspoon of the salt. Continue stirring for a minute, until all the spinach is wilted. Remove it from the pan and set aside.\nAdd the final tablespoon olive oil to the pan, raise the heat to medium, and add the turkey plus 1 teaspoon salt. Using a wooden spoon or spatula, break the turkey up into small morsels as it browns. When you have browned turkey, add the cumin, paprika, and black pepper. Stir to incorporate, toasting the spices for about 30 seconds.\nAdd the carrot-tomato mixture, the R-Rated Onions, vinegar, and ½ teaspoon salt. Let this cook for about 15 minutes, uncovered, stirring occasionally. You may need to lower the heat to prevent Joe from sticking or splattering. When the ragout is done it will be thick and juicy. If it seems too dry, stir in a little water. Taste the ragout for seasoning and adjust as you like.\nTurn the heat off and make four indentions in the ragout. Divide the spinach and put equal amounts in each indentation. Top each section of spinach with a cracked egg. Sprinkle the eggs with the remaining 1 teaspoon salt.\nSlide the skillet onto the middle rack of your preheated oven. Bake for 10 to 12 minutes, until the whites are set and the yolks are slightly runny.\nTo serve, scatter ribbons of Parmigiano Reggiano or another hard cheese over the top. If bread is your thing, this is great with toast.",
      "image": "sloppy-joe-shirred-eggs-with-spinach-vivian-howard",
      "ingredients": "['1 medium carrot, top removed and cut into about 6 pieces', '1 (14.5-ounce) can diced tomatoes, or 2 scant cups roughly chopped fresh tomatoes', '2 tablespoons extra virgin olive oil, divided', '3 garlic cloves, minced', '8 ounces fresh spinach (4 cups packed)', '3 teaspoons kosher salt, divided', '1 pound ground turkey', '2 teaspoons ground cumin', '1 teaspoon smoked paprika', '½ teaspoon ground black pepper', '½ cup R-Rated Onions', '2 tablespoons red wine vinegar', '4 large eggs Parmigiano Reggiano', 'for serving (optional)']"
    },
    {
      "id": 21,
      "title": "R-Rated Onions",
      "instructions": "Peel your onions and cut them in half through their stem ends—longways, if you will. Slice them thinly with the grain, following the line from root to stem rather than cutting the onion across its belly. This is actually important because slicing it the other way makes the path to silky onions a longer one.\nOnce your onions are sliced, heat your skillet over medium-high heat and add the oil, then the onions and the salt. Let the onions sizzle for a couple minutes. Stir with a wooden spoon or a heatproof spatula and watch as they wilt for about 3 more minutes. At this point, reduce the heat to medium low. Put a lid on and step away for a few minutes. Give the onions a stir every now and then. You don’t have to stand over it like risotto, but don’t go for a walk around the block either. Caramelized bits will accumulate at the bottom and sides of the pan, and that’s good. Just scrape them up and stir them in. A little color building as you go is okay, but don’t rush to brown them. The point is to cook the onions gently, coaxing them through stages of raw, wilted, sweaty, soft, light brown, and finally deeply caramelized\nAbout 45 minutes in, remove the lid for the last time. They should be a light caramel color. Now, with the lid off, you will need to watch more closely and stir more frequently. At some point you may find that despite your best efforts some of the caramelized bits, verging on burnt, cling to the pan and threaten over all onion ruin. Do not fret! Just add a ½ cup or so of water and use its energy to help scrape up the stubborn but tasty film. Let the water cook out of course. When you’re smiling over a soft, creamy, fragrant pile of mahogany onions, you’re done.\nNote: R-Rated Onions will keep in the fridge for a week and in the freezer for 3 months.",
      "image": "r-rated-caramelized-onions-vivian-howard",
      "ingredients": "['4–5 large or 6–8 medium yellow or white onions', '1 Tbsp olive or vegetable oil', '1 tsp kosher salt']"
    },
    {
      "id": 22,
      "title": "Miso-Squash Ramen",
      "instructions": "Preheat oven to 400°F. Whisk oil, miso, maple syrup, and soy sauce in a small bowl until a thick paste forms. Place squash on a rimmed baking sheet and scrape dressing over; toss to coat. Arrange squash in a single layer and roast until fork-tender (it will be a little caramelized in spots), 25–30 minutes.\nHeat oil in a medium pot over medium-high. Add ginger and garlic and cook, stirring, 1 minute. Add broth and bring to a boil. Remove from heat.\nSet 8 roasted squash wedges (or about 2 cups if using butternut) aside for serving. Add miso and remaining squash to pot and blend with an immersion blender until mostly smooth; season with salt and pepper. (Alternatively, you can let broth cool slightly, then purée with sqush and miso in a regular blender.)\nMeanwhile, bring a large pot of salted water to the boil and cook broccolini until crisp-tender, about 3 minutes. Using tongs, transfer to a plate.\nAdd noodles to same pot and cook according to packet directions. Drain and divide noodles among bowls.\nLadle broth over noodles and arrange broccolini and reserved squash (cut in half if they are very big) on top. Scatter cilantro over.",
      "image": "miso-squash-ramen-hetty-mckinnon",
      "ingredients": "['1 Tbsp. extra-virgin olive oil', '1 Tbsp. white miso', '2 tsp. pure maple syrup or brown sugar', '1 tsp. regular soy sauce or tamari', '1 small kabocha squash (about 2 lb.), peeled, cut into 1\"-thick wedges, or 1 small butternut squash (about 2 lb.), peeled, cut into 1\" pieces', '1 Tbsp. extra-virgin olive oil', '1 (1\") piece ginger, coarsely chopped', '2 garlic cloves, coarsely chopped', '4 cups low-sodium vegetable broth', '2 Tbsp. white miso', 'Kosher salt, freshly ground pepper', '1 large bunch broccolini (8–10 oz.), halved crosswise, thicker stalks halved lengthwise', '4 (5-oz.) packages wavy ramen noodles, preferably fresh', 'Handful of cilantro leaves with tender stems']"
    },
    {
      "id": 23,
      "title": "Spicy Coconut Pumpkin Soup",
      "instructions": "Heat the coconut oil in a large saucepan over medium heat. Add the pumpkin, stir well, and cook, covered, for 15 minutes.\nAdd the onion, garlic, and ají dulce and stir well. Sauté until the onion becomes translucent, 3 to 5 minutes, then add the brown sugar and cumin. Mix well. Cook until the sugar melts, 2 to 3 minutes.\nStir in the coconut milk and broth. Bring to a simmer and cook, uncovered, until the pumpkin is very soft, about 15 minutes.\nUsing an immersion blender, blend the soup into a smooth purée. Alternatively, remove the solids with a slotted spoon and place in a blender or food processor. Purée until smooth and return to the pan.\nBring back to a simmer and cook gently for 5 minutes so the flavors combine. Season with salt and black pepper to taste. Serve hot, garnished with the cilantro.",
      "image": "spicy-coconut-pumpkin-soup",
      "ingredients": "['2 tablespoons coconut oil', '1 pound calabaza pumpkin, seeded, peeled, and cut into chunks', '1 small onion, minced', '3 garlic cloves, minced', '1 ají dulce pepper, seeded and minced', '1 teaspoon dark brown sugar', '½ teaspoon ground cumin', '2 cups coconut milk', '1 cup chicken broth or vegetable broth', 'Salt and freshly ground black pepper', '2 tablespoons chopped fresh cilantro']"
    }
  ]
}
